Autodesk.Revit.DB.Structure.RebarCurvesData.SetNewPreferredConstraint(Autodesk.Revit.DB.Structure.RebarConstraint)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.SetPointToDeterminePositionFromPath(Autodesk.Revit.DB.XYZ)
Sets a point on the path used to determine the position of the computation curves with respect to path.
This point is set and used by the 3D path server only to react to the changes of the path edge.
pointOnPathToDeterminePositionFromPath:
A point on the path to determine the position of the computation curves with respect to path.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.CanAddBarGeometry
If the layout rule is Single or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.
If the layout rule is CustomSpacing, it will return true if GetNumberOfBarGeometry() is less the number of bars (specified by the formula), false otherwise.
For the other layout types, will return true.
Returns:
Returns true if we can add more bar geometry for the current layout, false otherwise.
Since:
2018

Autodesk.Revit.DB.Structure.RebarCurvesData.GetAddedBarGeometry(System.Int32)
Gets the added curves that will represent the bar at index barIndex.
barIndex:
The index of the bar. Should be a number between 0 and GetNumberOfBarGeometry() - 1.
Returns:
Returns the curves that will represent the bar at index barIndex. The terminations' plane normals will be applied on these curves.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
barIndex is not in the range [ 0, GetNumberOfBarGeometry()-1 ].
Since:
2018